# MajorLayoutPattern Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..MajorLayoutPattern Property
FabricSheetType Class See Also
---
The layout pattern in the major direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FabricSheetLayoutPattern MajorLayoutPattern { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MajorLayoutPattern As FabricSheetLayoutPattern
	Get
```

Visual C++
---
```text
public:
property FabricSheetLayoutPattern MajorLayoutPattern {
	FabricSheetLayoutPattern get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace